In [80]:
import pandas as pd

## Import Raw Files

In [81]:
student_list = pd.read_csv('data/student_list.csv', skiprows=[1])

In [82]:
historical = pd.read_csv('data/Historical Demographic Data.csv', header=1)

In [83]:
student_program = pd.read_csv('data/Student Query Name and Program.csv')

In [84]:
student_list.head()

                   name  name_title ethnicity
0       Omar M. Barakat         NaN     Asian
1           Lucas Breit         NaN     Asian
2          Stella Breit         NaN     Asian
3  Julian Rizk Callahan         NaN     Asian
4       Magnolia Ciardi         NaN     Asian

In [85]:
student_list.shape

(338, 3)

In [86]:
historical

    2008-2009   295  30   6  23  236   0  295.1   59  20.00%     4
0   2009-2010   316  30   7  22  257   0    316   59  18.67%   6.0
1   2010-2011   334  39   4  25  266   0    334   68  20.36%   6.0
2   2011-2012   350  41   7  22  280   0    350   70  20.00%   8.0
3   2012-2013   371  55  10  27  279   0    371   92  24.80%  11.0
4   2013-2014   376  49  12  30  285   0    376   91  24.20%  11.0
5   2014-2015   383  47  13  32  291   0    383   92  24.02%  13.0
6   2015-2016   397  55  16  32  294   0    397  103  25.94%  16.0
7   2016-2017   405  59  17  36  293   0    405  112  27.65%  17.0
8   2017-2018   410  58  20  40  292   0    410  118  28.78%  25.0
9   2018-2019   411  55  20  41  295   0    411  116  28.22%  21.0
10  2019-2020   391  59  16  44  272   0    391  119  30.40%  17.0
11   2020-2021  333  45  10  37  241   0    333   92  27.60%   9.0
12   2021-2022  361  34   9  30  246  42    361   73  22.60%   NaN

In [87]:
student_program.head()

,Person ID,Full Name,Current Grade,Ethnicity,Enrollment Status,Roles
0,100314.0,"Bechard, Declan",Toddler,Caucasian,EN: Newly Enrolled,"Student (T), Prg Stud"
1,100318.0,"Carrigan, JonMateo",Toddler,Multi-racial,EN: Newly Enrolled,"Student (T), Prg Stud"
2,100319.0,"Ciardi, Nelson",Toddler,Asian,EN: Newly Enrolled,"Student (T), Prg Stud"
3,100320.0,"Elkington, Max",Toddler,Caucasian,EN: Newly Enrolled,"Student (T), Prg Stud"
4,100354.0,"Gaster, Eve",Toddler,<None Specified>,EN: Newly Enrolled,Student (T)

In [88]:
student_program.shape

(365, 6)

In [89]:
names = student_program['Full Name'].str.split(',', expand=True)

In [90]:
names.head(2)

          0          1
0   Bechard     Declan
1  Carrigan   JonMateo

In [91]:
student_program['Last Name'] = names[0]

In [92]:
student_program['First Name'] = names[1]

In [93]:
student_list['name'].str.split(' ', expand=True)

            0         1         2     3
0        Omar        M.   Barakat  None
1       Lucas     Breit      None  None
2      Stella     Breit      None  None
3      Julian      Rizk  Callahan  None
4    Magnolia    Ciardi      None  None
..        ...       ...       ...   ...
333   Rebecca     Asher    Wilson  None
334       Ava      Wise      None  None
335       Asa  Trussell   Wolfson  None
336      Alec   Younger      None  None
337   Annabel    Zolner      None  None

[338 rows x 4 columns]

In [94]:
student_list.head(3)

              name  name_title ethnicity
0  Omar M. Barakat         NaN     Asian
1      Lucas Breit         NaN     Asian
2     Stella Breit         NaN     Asian

In [95]:
student_list['name']

0           Omar M. Barakat
1               Lucas Breit
2              Stella Breit
3      Julian Rizk Callahan
4           Magnolia Ciardi
               ...
333    Rebecca Asher Wilson
334                Ava Wise
335    Asa Trussell Wolfson
336            Alec Younger
337          Annabel Zolner
Name: name, Length: 338, dtype: object

In [96]:
p = r'^(?P<First_Name>.*) \b\s*(?P<Middle_Name>.*) (?P<Last_Name>\S+)' 
middle = student_list['name'].str.extract(p)

In [97]:
middle = middle.dropna()

In [98]:
p = r'^(?P<First_Name>.*) (?P<Last_Name>\S+)' 
last = student_list['name'].str.extract(p)

In [99]:
student_list_combined = pd.merge(student_list, last, how='left',left_index=True, right_index=True)

In [100]:
student_list_combined = pd.merge(student_list_combined, middle, how='left',left_index=True, right_index=True)

In [101]:
student_list_combined.head()

,name,name_title,ethnicity,First_Name_x,Last_Name_x,First_Name_y,Middle_Name,Last_Name_y
0,Omar M. Barakat,NaN,Asian,Omar M.,Barakat,Omar,M.,Barakat
1,Lucas Breit,NaN,Asian,Lucas,Breit,NaN,NaN,NaN
2,Stella Breit,NaN,Asian,Stella,Breit,NaN,NaN,NaN
3,Julian Rizk Callahan,NaN,Asian,Julian Rizk,Callahan,Julian,Rizk,Callahan
4,Magnolia Ciardi,NaN,Asian,Magnolia,Ciardi,NaN,NaN,NaN

In [102]:
student_list_combined.loc[student_list_combined['First_Name_y'].isnull(), 'First_Name_y'] = student_list_combined['First_Name_x']

In [103]:
student_list_combined.loc[student_list_combined['Last_Name_y'].isnull(), 'Last_Name_y'] = student_list_combined['Last_Name_x']

In [104]:
student_list_combined.head()

,name,name_title,ethnicity,First_Name_x,Last_Name_x,First_Name_y,Middle_Name,Last_Name_y
0,Omar M. Barakat,NaN,Asian,Omar M.,Barakat,Omar,M.,Barakat
1,Lucas Breit,NaN,Asian,Lucas,Breit,Lucas,NaN,Breit
2,Stella Breit,NaN,Asian,Stella,Breit,Stella,NaN,Breit
3,Julian Rizk Callahan,NaN,Asian,Julian Rizk,Callahan,Julian,Rizk,Callahan
4,Magnolia Ciardi,NaN,Asian,Magnolia,Ciardi,Magnolia,NaN,Ciardi

In [105]:
student_list_combined = student_list_combined.drop(columns=['First_Name_x','Last_Name_x'], index=1)

In [106]:
student_list_combined.columns

Index(['name', 'name_title', 'ethnicity', 'First_Name_y', 'Middle_Name',
       'Last_Name_y'],
      dtype='object')

In [107]:
student_list_combined.columns = ['name', 'name_title', 'ethnicity', 'First Name', 'Middle Name',
       'Last Name']

In [108]:
student_list_combined.columns

Index(['name', 'name_title', 'ethnicity', 'First Name', 'Middle Name',
       'Last Name'],
      dtype='object')

In [109]:
student_list_combined['First Name'] = student_list_combined['First Name'].str.strip()
student_list_combined['Last Name'] = student_list_combined['Last Name'].str.strip()
student_program['First Name'] = student_program['First Name'].str.strip()
student_program['Last Name'] = student_program['Last Name'].str.strip()

In [110]:
student_list_combined.head()

                   name  name_title ethnicity First Name Middle Name Last Name
0       Omar M. Barakat         NaN     Asian       Omar          M.   Barakat
2          Stella Breit         NaN     Asian     Stella         NaN     Breit
3  Julian Rizk Callahan         NaN     Asian     Julian        Rizk  Callahan
4       Magnolia Ciardi         NaN     Asian   Magnolia         NaN    Ciardi
5       Nelson D Ciardi         NaN     Asian     Nelson           D    Ciardi

In [111]:
student_program.head()

,Person ID,Full Name,Current Grade,Ethnicity,Enrollment Status,Roles,Last Name,First Name
0,100314.0,"Bechard, Declan",Toddler,Caucasian,EN: Newly Enrolled,"Student (T), Prg Stud",Bechard,Declan
1,100318.0,"Carrigan, JonMateo",Toddler,Multi-racial,EN: Newly Enrolled,"Student (T), Prg Stud",Carrigan,JonMateo
2,100319.0,"Ciardi, Nelson",Toddler,Asian,EN: Newly Enrolled,"Student (T), Prg Stud",Ciardi,Nelson
3,100320.0,"Elkington, Max",Toddler,Caucasian,EN: Newly Enrolled,"Student (T), Prg Stud",Elkington,Max
4,100354.0,"Gaster, Eve",Toddler,<None Specified>,EN: Newly Enrolled,Student (T),Gaster,Eve

In [112]:
combined_student_list = pd.merge(student_program, student_list_combined, how='left',
                                 on =['First Name','Last Name'])

In [113]:
combined_student_list.shape

(365, 12)

In [114]:
combined_student_list.head()

,Person ID,Full Name,Current Grade,Ethnicity,Enrollment Status,Roles,Last Name,First Name,name,name_title,ethnicity,Middle Name
0,100314.0,"Bechard, Declan",Toddler,Caucasian,EN: Newly Enrolled,"Student (T), Prg Stud",Bechard,Declan,Declan Bechard,NaN,White,NaN
1,100318.0,"Carrigan, JonMateo",Toddler,Multi-racial,EN: Newly Enrolled,"Student (T), Prg Stud",Carrigan,JonMateo,NaN,NaN,NaN,NaN
2,100319.0,"Ciardi, Nelson",Toddler,Asian,EN: Newly Enrolled,"Student (T), Prg Stud",Ciardi,Nelson,Nelson D Ciardi,NaN,Asian,D
3,100320.0,"Elkington, Max",Toddler,Caucasian,EN: Newly Enrolled,"Student (T), Prg Stud",Elkington,Max,Max Elkington,NaN,White,NaN
4,100354.0,"Gaster, Eve",Toddler,<None Specified>,EN: Newly Enrolled,Student (T),Gaster,Eve,Eve Gaster,NaN,Prefer Not To Answer,NaN

In [115]:
combined_student_list = combined_student_list.dropna(how='all')

In [116]:
# combined_student_list[combined_student_list['ethnicity'].isnull()]

In [117]:
combined_student_list.columns

Index(['Person ID', 'Full Name', 'Current Grade', 'Ethnicity',
       'Enrollment Status', 'Roles', 'Last Name', 'First Name', 'name',
       'name_title', 'ethnicity', 'Middle Name'],
      dtype='object')

In [118]:
final_student_list = combined_student_list[['First Name', 'Last Name', 'ethnicity', 'Current Grade']]

In [119]:
final_student_list.shape

(361, 4)

In [120]:
final_student_list.to_csv('data/final_student_list.csv', index=False)

In [121]:
final_student_list[~final_student_list['ethnicity'].isnull()].shape

(323, 4)

In [122]:
final_student_list['ethnicity'].value_counts()

White                        246
Asian                         34
Hispanic or Latino            30
Black or African American      9
Prefer Not To Answer           4
Name: ethnicity, dtype: int64

In [125]:
final_student_list[final_student_list['ethnicity'].isnull()].to_csv('student_missing_demo.csv', index=False)

## Map

In [8]:
import geopandas as gpd
import matplotlib.pyplot as plt
import pyproj
import plotly.graph_objs as go

In [9]:
chi_zips = gpd.read_file(r"Boundaries - ZIP Codes/geo_export_a9707f61-f834-4e7b-b8a5-0f0ff4c8412d.shp")

In [10]:
map_df = chi_zips 
map_df.to_crs(pyproj.CRS.from_epsg(4326), inplace=True)

In [12]:
map_df.head()

,objectid,shape_area,shape_len,zip,geometry
0,33.0,1.060523e+08,42720.044406,60647,"POLYGON ((-87.67762 41.91776, -87.67761 41.917..."
1,34.0,1.274761e+08,48103.782721,60639,"POLYGON ((-87.72683 41.92265, -87.72693 41.922..."
2,35.0,4.506904e+07,27288.609612,60707,"POLYGON ((-87.78500 41.90915, -87.78531 41.909..."
3,36.0,7.085383e+07,42527.989679,60622,"POLYGON ((-87.66707 41.88885, -87.66707 41.888..."
4,37.0,9.903962e+07,47970.140153,60651,"POLYGON ((-87.70656 41.89555, -87.70672 41.895..."

In [15]:
import folium
import branca.colormap as cm

In [36]:
x_map=map_df.centroid.x.mean()
y_map=map_df.centroid.y.mean()+.1

<ipython-input-36-94f388c2eff9>:1: UserWarning: Geometry is in a geographic CRS. Results from 'centroid' are likely incorrect. Use 'GeoSeries.to_crs()' to re-project geometries to a projected CRS before this operation.

  x_map=map_df.centroid.x.mean()
<ipython-input-36-94f388c2eff9>:2: UserWarning: Geometry is in a geographic CRS. Results from 'centroid' are likely incorrect. Use 'GeoSeries.to_crs()' to re-project geometries to a projected CRS before this operation.

  y_map=map_df.centroid.y.mean()+.1

In [1]:
# mymap = folium.Map(location=[y_map, x_map], zoom_start=12,tiles=None)
# folium.TileLayer('CartoDB positron',name="Light Map",control=False).add_to(mymap)
# mymap

##